src/test/java/com/structurizr/export/mermaid/36141-SystemLandscape.mmd
graph TB
  linkStyle default fill:#ffffff

  subgraph diagram [System Landscape for Big Bank plc]
    style diagram fill:#ffffff

    subgraph enterprise [Big Bank plc]
      style enterprise fill:#ffffff,stroke:#444444,color:#444444

      12["<div style='font-weight: bold'>Customer Service Staff</div><div style='font-size: 70%; margin-top: 0px'>[Person]</div><div style='font-size: 80%; margin-top:10px'>Customer service staff within<br />the bank.</div>"]
      style 12 fill:#999999,stroke:#6b6b6b,color:#ffffff
      15["<div style='font-weight: bold'>Back Office Staff</div><div style='font-size: 70%; margin-top: 0px'>[Person]</div><div style='font-size: 80%; margin-top:10px'>Administration and support<br />staff within the bank.</div>"]
      style 15 fill:#999999,stroke:#6b6b6b,color:#ffffff
      2["<div style='font-weight: bold'>Internet Banking System</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>Allows customers to view<br />information about their bank<br />accounts, and make payments.</div>"]
      style 2 fill:#1168bd,stroke:#0b4884,color:#ffffff
      4["<div style='font-weight: bold'>Mainframe Banking System</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>Stores all of the core<br />banking information about<br />customers, accounts,<br />transactions, etc.</div>"]
      style 4 fill:#999999,stroke:#6b6b6b,color:#ffffff
      6["<div style='font-weight: bold'>E-mail System</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>The internal Microsoft<br />Exchange e-mail system.</div>"]
      style 6 fill:#999999,stroke:#6b6b6b,color:#ffffff
      9["<div style='font-weight: bold'>ATM</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>Allows customers to withdraw<br />cash.</div>"]
      style 9 fill:#999999,stroke:#6b6b6b,color:#ffffff
    end

    1["<div style='font-weight: bold'>Personal Banking Customer</div><div style='font-size: 70%; margin-top: 0px'>[Person]</div><div style='font-size: 80%; margin-top:10px'>A customer of the bank, with<br />personal bank accounts.</div>"]
    style 1 fill:#08427b,stroke:#052e56,color:#ffffff

    9-. "<div>Uses</div><div style='font-size: 70%'></div>" .->4
    1-. "<div>Withdraws cash using</div><div style='font-size: 70%'></div>" .->9
    12-. "<div>Uses</div><div style='font-size: 70%'></div>" .->4
    1-. "<div>Asks questions to</div><div style='font-size: 70%'>[Telephone]</div>" .->12
    15-. "<div>Uses</div><div style='font-size: 70%'></div>" .->4
    1-. "<div>Views account balances, and<br />makes payments using</div><div style='font-size: 70%'></div>" .->2
    2-. "<div>Gets account information<br />from, and makes payments<br />using</div><div style='font-size: 70%'></div>" .->4
    2-. "<div>Sends e-mail using</div><div style='font-size: 70%'></div>" .->6
    6-. "<div>Sends e-mails to</div><div style='font-size: 70%'></div>" .->1
  end
